In [1]:
pip install selenium

Requirement already satisfied: selenium in c:\users\user\anaconda3\lib\site-packages (3.141.0)
Requirement already satisfied: urllib3 in c:\users\user\anaconda3\lib\site-packages (from selenium) (1.25.11)
Note: you may need to restart the kernel to use updated packages.

In [1]:
import selenium
import pandas as pd
import numpy as np
from selenium import webdriver
import time
from selenium.common.exceptions import NoSuchElementException
from selenium.webdriver.support.ui import WebDriverWait
from selenium.webdriver.support import expected_conditions as EC
from selenium.webdriver.common.by import By
from selenium.webdriver.common.keys import Keys

### Q1. Write a python program to scrape data for “Data Analyst” Job position in “Bangalore” location. You have to scrape the job-title, job-location, company_name, experience_required. You have to scrape first 10 jobs data.
This task will be done in following steps:
1. first get the webpage https://www.naukri.com/
2. Enter “Data Analyst” in “Skill,Designations,Companies” field and enter “Bangalore” in “enter the location” field.
3. Then click the search button.
4. Then scrape the data for the first 10 jobs results you get.
5. Finally create a dataframe of the scraped data.
Note- All of the above steps have to be done in code. No step is to be done manually.

In [2]:
driver = webdriver.Chrome(r"C:\Users\User\Downloads\chromedriver_win32\chromedriver.exe")

In [3]:
url = "https://www.naukri.com/"
driver.get(url)

In [4]:
search_job = driver.find_element_by_id('qsb-keyword-sugg')
search_job

In [5]:
search_job.send_keys("Data Analyst")

In [6]:
search_loc = driver.find_element_by_id("qsb-location-sugg")
search_loc.send_keys("Bangalore")

In [7]:
search_btn = driver.find_element_by_xpath("//button[@class='btn']")
search_btn.click()

In [8]:
titles_tags = driver.find_elements_by_xpath("//a[@class='title fw500 ellipsis']")
job_titles = []
for i in titles_tags:
    job_titles.append(i.text)

In [9]:
experience_tags = driver.find_elements_by_xpath("//li[@class='fleft grey-text br2 placeHolderLi experience']")
experience_titles = []
for i in experience_tags:
    experience_titles.append(i.text.replace(" Yrs",""))

In [10]:
company_tags= driver.find_elements_by_xpath("//a[@class='subTitle ellipsis fleft']")
company_titles = []
for i in company_tags:
    company_titles.append(i.text)

In [11]:
location_tags = driver.find_elements_by_xpath("//li[@class='fleft grey-text br2 placeHolderLi location']")
location_names=[]
for i in location_tags:
    location_names.append(i.text)

In [12]:
print(len(job_titles),len(company_titles),len(experience_titles),len(location_names))

20 20 20 20

In [13]:
#import pandas as pd

In [14]:
df = pd.DataFrame(np.column_stack([job_titles[0:10], experience_titles[0:10], company_titles[0:10], location_names[0:10]]), 
                               columns=["Title", "Experience (Yrs)", "Company","Location"])

In [15]:
df

,Title,Experience (Yrs),Company,Location
0,Associate Systems and Data Analyst,0-4,Boeing,Bangalore/Bengaluru
1,Consultant-Data Analyst -Bangalore,2-7,Innovsource Services Private Limited,Bangalore/Bengaluru
2,Data Scientist / Data Analyst -Business Analyst,0-3,Inflexion Analytix Private Limited,"Mumbai, Hyderabad/Secunderabad, Pune, Gurgaon/..."
3,Data Analyst,1-3,Flipkart Internet Private Limited,Bangalore/Bengaluru
4,Hiring For Data Analyst @ Flipkart on Contract,2-6,Flipkart Internet Private Limited,Bangalore/Bengaluru
5,Data Analyst,3-7,IBM India Pvt. Limited,Bangalore/Bengaluru
6,Deputy Manager - Data Analyst,3-6,Schneider Electric India Pvt. Ltd.,Bangalore/Bengaluru
7,Senior Data Analyst,2-5,Flipkart Internet Private Limited,Bangalore/Bengaluru
8,Data Analyst / Business Analyst -,1-5,LatentView Analytics Private Limited,"Chennai, Bangalore/Bengaluru"
9,Business Data Analyst,5-10,ALSTOM India Limited,Bangalore/Bengaluru

### Q2. Write a python program to scrape data for “Data Scientist” Job position in “Bangalore” location. You have to scrape the job-title, job-location, company_name, full job-description. You have to scrape first 10 jobs data.
This task will be done in following steps:
1. first get the webpage https://www.naukri.com/
2. Enter “Data Scientist” in “Skill,Designations,Companies” field and enter “Bangalore” in “enter the location” field.
3. Then click the search button.
4. Then scrape the data for the first 10 jobs results you get.
5. Finally create a dataframe of the scraped data.

Note- 
1. All of the above steps have to be done in code. No step is to be done manually.
2.Please note that you have to scrape full job description. For that you may have to open each job separately as shown below

In [34]:
driver = webdriver.Chrome(r"C:\Users\User\Downloads\chromedriver_win32\chromedriver.exe")

In [35]:
url = "https://www.naukri.com/"
driver.get(url)

In [36]:
search_job = driver.find_element_by_id('qsb-keyword-sugg')
search_job

In [37]:
search_job.send_keys("Data Scientist")

In [38]:
search_loc = driver.find_element_by_id("qsb-location-sugg")
search_loc.send_keys("Bangalore")

In [39]:
search_btn = driver.find_element_by_xpath("//button[@class='btn']")
search_btn.click()

In [40]:
titles_tags = driver.find_elements_by_xpath("//a[@class='title fw500 ellipsis']")
job_titles = []
for i in titles_tags:
    job_titles.append(i.text)

In [42]:
job_titles

['Senior Data Scientist',
 'Senior Data Scientist',
 'Data Scientist',
 'Data Scientist',
 'Looking For Data Scientist For Infogain',
 'Data Scientist - Python/MATLAB/Machine Learning Algorithms',
 'Data Scientist - Machine Learning',
 'Senior / Lead Data Scientist',
 'Data Scientist',
 'Hiring For DATA Scientist - ON Contract Basis (3-6 Months)',
 'Lead Data Scientist',
 'Senior Data Scientist - Demand Generation',
 'Senior Data Scientist - Demand Generation',
 'Senior Data Scientist',
 'Analytics Lead - Data Scientist',
 'Sr. Data Scientist',
 'Senior Data Scientist',
 'Senior Data Scientist',
 'Senior Associate/Team Lead - Data Scientist Consulting',
 'Senior Data Scientist']

In [43]:
experience_tags = driver.find_elements_by_xpath("//li[@class='fleft grey-text br2 placeHolderLi experience']")
experience_titles = []
for i in experience_tags:
    experience_titles.append(i.text.replace(" Yrs",""))

In [44]:
company_tags= driver.find_elements_by_xpath("//a[@class='subTitle ellipsis fleft']")
company_titles = []
for i in company_tags:
    company_titles.append(i.text)

In [45]:
location_tags = driver.find_elements_by_xpath("//li[@class='fleft grey-text br2 placeHolderLi location']")
location_names=[]
for i in location_tags:
    location_names.append(i.text)

In [46]:
urls  = []
for i in range(0,1):
    for j in driver.find_elements_by_xpath('//a[@class="title fw500 ellipsis"]'):
        urls.append(j.get_attribute('href'))
    driver.find_element_by_xpath('//a[@class="fright fs14 btn-secondary br2"]').click()
#end.get_attribute('href').click()
    time.sleep(3)

In [47]:
job_desc = []

for i in urls:
    driver.get(i)
    desc = driver.find_element_by_xpath("//*[contains(text(),' ')]")
    job_desc.append(desc.text.replace('\n', ''))

In [48]:
print(len(job_titles),len(company_titles),len(experience_titles),len(location_names),len(job_desc))

20 20 20 20 20

In [49]:
job_desc[0]

'JOBSRECRUITERSCOMPANIESTOOLSSERVICESMORELOGINFOR EMPLOYERSHome > MumbaiSenior Data ScientistFractal Analytics3.8(92 Reviews)4 - 8 yearsNot DisclosedMumbai, Gurgaon/Gurugram, Bangalore/BengaluruRegister to applyLOGIN TO APPLYPosted: 5 days agoOpenings: 1Job Applicants: 340Send Me Jobs Like ThisJob descriptionJob Responsibilities:Work with product managers and clients to better understand the business problemThink through a business problem and come up with a set of hypothesesCreate a list of potentially relevant supporting data elementsWork with data engineers and/or data analysts to procure data and test it for problemsCollaborate with other Data ScientistsPropose modeling approachesMine the data to check completeness, value distributions, etc.Data imputation and feature engineeringTest data for signalRun feature selectionTune the modelSet up tests for the model healthCollaborate with product managers to find the best way to present the resultsWork with developers on productionizing modelsMust HaveA minimum of 6 years of post-academic experience developing advanced analytics and applying data science in a business environmentExperience in data mining techniques and methodologies (data prep/modeling, classification, regression, clustering, causal modeling, AI, machine learning, ensemble approaches)Experience developing in Python within a production environmentAdvanced experience in data visualization tools with a strong grasp of effective data modeling and visualization practicesThe ability to rapidly develop proof of concepts and test new ideas, as well as the ability to scale these ideas into production ready models that can be deployed within our organizationExamples of how your passion for data driven decision making and intellectual curiosity translated in to value for your organizationNice to HaveAn advanced Degree (Masters or PhD) in engineering, mathematics, physics, economics, computer science, statistics, or business analytics orExperience leveraging cloud platforms such as Amazon Web Services (AWS) and Google Cloud Platform (GCP)Strong research skills and the ability to put emerging ideas into practiceRoleTechnical ArchitectIndustry TypeManagement ConsultingFunctional AreaIT Software - Application Programming, MaintenanceEmployment TypeFull Time, PermanentRole CategoryProgramming & DesignEducationUG :Any Graduate in Any SpecializationPG :Post Graduation Not RequiredKey SkillsComputer scienceGCPData modelingArtificial IntelligenceBusiness analyticsMachine learningData miningAWSPythonTestingAbout CompanyFractal is one of the most prominent players in the Artificial Intelligence space. Fractals mission is to power every human decision in the enterprise and uses the power of AI to help the worlds most admired Fortune 500 companies.Fractals products include Qure.ai to assist radiologists make better diagnostic decisions, Cuddle.ai to assists CEOs and senior executives make better tactical and strategic decisions, Theremin.ai to improve investment decisions and Eugenie.ai to find anomalies in high velocity data.Fractal has consistently been rated as Indias best companies to work for, by The Great Place to WorkInstitute. Fractal has been featured as a leader in the Customer Analytics Service Providers Wave2019 by Forrester Research, and recognized as an Honorable Vendorin 2019 magic quadrant for data & analytics by Gartner.Company InfoWebsitehttps://boards.greenhouse.io/fractalai/jobs/5280897002?gh_jid=5280897002Beware of imposters!Naukri.com does not promise a job or an interview in exchange of money. Fraudsters may ask you to pay in the pretext of registration fee, Refundable Fee…Read MoreSimilar JobsSenior Data ScientistFractal Analytics3.8(92 reviews)Gurgaon/Gurugram, Bangalore/Bengaluru, Mumbai (All Areas)R,NoSQL,SAS,Artificial Intelligence,Data Structures,Go,Supply Chain Management,Data Analytics,Machin...Posted 5 days agoLead Data Scientist - Immediate JoiningWaisl LimitedNew DelhiArtificial Intelligence,Jupyter,Machine Learning,PythonPosted 3 days agoSenior Data ScientistSmartdrive Systems India Pvt Ltd.4.0(71 reviews)Bangalore/BengaluruPredictive Modeling,Data Wrangling,Artificial Intelligence,Data Cleansing,Data Collection,Statistica...Posted 4 days agoSenior Data ScientistVIAPROM AnalyticsMumbaiPredictive Modeling,Data Science,R,Logistic Regression,Natural Language Processing,Senior Data Scien...Posted 23 days agoSenior Data ScientistTimes GlobalMumbaiData Science,R,Algorithms,Content Marketing,Customer Segmentation,Tableau,Statistics,Analytics,Pytho...Posted 26 days agoJobs you might be interested inBig Data Analysis Tool and Techniques Digital Data EngineeringAccenture Solutions Pvt L...4.0(17967 reviews)Bangalore/BengaluruPosted 5 days agoSr . Data ScientistQventusREMOTEPosted 5 days agoSr Data ScientistHims & Hers - Hims, Inc.RemotePosted 5 days agoView AllReviewspowered bySenior Data Scientist in Bangalore Rural05 May 2021AnonymousLikesGreat company to learn. one get to learn many different things. but that is all dependent on the projects you get mapped to Project to Project. poor work life balanceRead All 92 ReviewsFollow Fractal Analytics to receive the latest job postings and alertsFollow2.1k followersSalary Insightspowered byCompare salaries of Senior Data Scientist with similar companies.Avg. Salary - ₹23 LakhsMin - ₹15.8LMax - ₹30LCOMPARE SALARYBenefits & Perkspowered by46 Users reported these benefitsFree FoodWork From HomeCafeteriaHealth InsuranceJob TrainingTeam OutingsView AllServices you might be interested inResume DisplayIncrease your profile visibility to recruiters upto 3 timesGet a Featured Profile, Stand out and get noticed in recruiter eyes.* May include paid servicesKnow MoreIEIL has taken all reasonable steps to ensure that information on this site is authentic. Applicants are advised to research bonafides of advertisers independently. IEIL shall not have any responsibility in this regard. We also recommend that you visit Security Guidelines and Terms and Conditions for more comprehensive information on this aspect.InformationAbout UsTerms & ConditionsPrivacy PolicyCareers with UsSitemapContact UsFAQsSummons / NoticesGrievancesFraud AlertTrust and SafetyNaukri on Mobile    JobseekersUpload ResumeSearch JobsCreate Job AlertReport a ProblemNaukri BlogsBrowse JobsBrowse All JobsPremium MBA JobsPremium Engineering JobsGovt. JobsInternational JobsJobs in GulfJobs by CompanyJobs by CategoryJobs by DesignationJobs by LocationJobs by SkillJobseeker ServicesPriority ApplicantResume DisplayResume WritingJobs4URecruiter ConnectionNaukri LearningSoftware and TechnologyArtificial Intelligence and Data ScienceManagementFinanceCreativity and DesignEmerging TechnologiesEngineering-non CSHealthcareEnergy and EnvironmentSocial sciencesPersonal growthEmployersJob PostingResume Database AccessRecruiter LoginNaukri RMSBuy Resume Packages OnlineTransition ServicesReport a ProblemRecruiters from USA, callToll Free # 1866-557-3340Ambition BoxInterview QuestionsAbout CompaniesShare Interview AdviceWrite Company ReviewCompany ReviewsCompany SalariesFollow Us    Partner SitesAll rights reserved @ 2021 Info Edge (India) Ltd.'

In [50]:
df = pd.DataFrame(np.column_stack([job_titles[0:10], experience_titles[0:10], company_titles[0:10], location_names[0:10], job_desc[0:10]]), 
                               columns=["Title", "Experience (Yrs)", "Company","Location","Job Description"])

In [51]:
df

,Title,Experience (Yrs),Company,Location,Job Description
0,Senior Data Scientist,4-8,Fractal Analytics,"Mumbai, Gurgaon/Gurugram, Bangalore/Bengaluru",JOBSRECRUITERSCOMPANIESTOOLSSERVICESMORELOGINF...
1,Senior Data Scientist,5-10,Fractal Analytics,"Gurgaon/Gurugram, Bangalore/Bengaluru, Mumbai ...",JOBSRECRUITERSCOMPANIESTOOLSSERVICESMORELOGINF...
2,Data Scientist,8-13,Persistent Systems Limited.,"Hyderabad/Secunderabad, Pune, Bangalore/Bengaluru",HOMEABOUT USJOBSCONTACT USVIST USJob Descripti...
3,Data Scientist,4-9,Wipro Limited,"Kolkata, Hyderabad/Secunderabad, Chennai, Bang...",JOBSRECRUITERSCOMPANIESTOOLSSERVICESMORELOGINF...
4,Looking For Data Scientist For Infogain,10-20,Infogain India (P) Ltd.,"Noida(Sector-60 Noida), Bangalore/Bengaluru(El...",JOBSRECRUITERSCOMPANIESTOOLSSERVICESMORELOGINF...
5,Data Scientist - Python/MATLAB/Machine Learnin...,3-8,Wrackle Technologies Pvt Ltd,Bangalore/Bengaluru,JOBSRECRUITERSCOMPANIESTOOLSSERVICESMORELOGINF...
6,Data Scientist - Machine Learning,2-5,AugmatrixGo,Bangalore/Bengaluru,JOBSRECRUITERSCOMPANIESTOOLSSERVICESMORELOGINF...
7,Senior / Lead Data Scientist,3-8,TVS CREDIT SERVICES LIMITED,"Pune, Chennai, Bangalore/Bengaluru",JOBSRECRUITERSCOMPANIESTOOLSSERVICESMORELOGINF...
8,Data Scientist,6-10,Oracle India Pvt. Ltd.,Bangalore/Bengaluru,HomeWhy Join UsView Job OpportunitiesVisit UsD...
9,Hiring For DATA Scientist - ON Contract Basis ...,3-8,GlobalEdx Learning and Technology Solution Pvt...,"Hyderabad/Secunderabad, Bangalore/Bengaluru, M...",JOBSRECRUITERSCOMPANIESTOOLSSERVICESMORELOGINF...

### Q3: In this question you have to scrape data using the filters available on the webpage as shown below:
        
You have to use the location and salary filter.
You have to scrape data for “Data Scientist” designation for first 10 job results.
You have to scrape the job-title, job-location, company_name, experience_required.
The location filter to be used is “Delhi/NCR”
The salary filter to be used is “3-6” lakhs
The task will be done as shown in the below steps:
1. first get the webpage https://www.naukri.com/
2. Enter “Data Scientist” in “Skill,Designations,Companies” field .
3. Then click the search button.
4. Then apply the location filter and salary filter by checking the respective boxes
4. Then scrape the data for the first 10 jobs results you get.
5. Finally create a dataframe of the scraped data.

Note- All of the above steps have to be done in code. No step is to be done manually.

In [52]:
driver = webdriver.Chrome(r"C:\Users\User\Downloads\chromedriver_win32\chromedriver.exe")

In [53]:
url = "https://www.naukri.com/"
driver.get(url)

In [54]:
search_job = driver.find_element_by_id('qsb-keyword-sugg')
search_job

In [55]:
search_job.send_keys("Data Scientist")

In [56]:
search_btn = driver.find_element_by_xpath("//button[@class='btn']")
search_btn.click()

In [57]:
filter_button = driver.find_elements_by_xpath("//div[@class = 'mt-8 chckBoxCont']")
for i in filter_button:
    if 'Delhi / NCR' in i.text :
        i.click()
        break

In [58]:
filter_button = driver.find_elements_by_xpath("//div[@class = 'mt-8 chckBoxCont']")
for i in filter_button:
    if '3-6 Lakhs' in i.text :
        i.click()
        break

In [59]:
titles_tags = driver.find_elements_by_xpath("//a[@class='title fw500 ellipsis']")
job_titles = []
for i in titles_tags:
    job_titles.append(i.text)

In [60]:
experience_tags = driver.find_elements_by_xpath("//li[@class='fleft grey-text br2 placeHolderLi experience']")
experience_titles = []
for i in experience_tags:
    experience_titles.append(i.text.replace(" Yrs",""))

In [61]:
company_tags= driver.find_elements_by_xpath("//a[@class='subTitle ellipsis fleft']")
company_titles = []
for i in company_tags:
    company_titles.append(i.text)

In [62]:
location_tags = driver.find_elements_by_xpath("//li[@class='fleft grey-text br2 placeHolderLi location']")
location_names=[]
for i in location_tags:
    location_names.append(i.text)

In [63]:
print(len(job_titles),len(company_titles),len(experience_titles),len(location_names))

20 20 20 20

In [64]:
#import pandas as pd

In [65]:
df = pd.DataFrame(np.column_stack([job_titles[0:10], experience_titles[0:10], company_titles[0:10], location_names[0:10]]), 
                               columns=["Title", "Experience (Yrs)", "Company","Location"])

In [66]:
df

,Title,Experience (Yrs),Company,Location
0,Senior Data Scientist,4-8,Fractal Analytics,"Mumbai, Gurgaon/Gurugram, Bangalore/Bengaluru"
1,Senior Data Scientist,5-10,Fractal Analytics,"Gurgaon/Gurugram, Bangalore/Bengaluru, Mumbai ..."
2,NLP - Data Scientist,0-4,Quadrangle Search,Delhi / NCR
3,Data Scientist / Data Analyst -Business Analyst,0-3,Inflexion Analytix Private Limited,"Mumbai, Hyderabad/Secunderabad, Pune, Gurgaon/..."
4,Senior Data Scientist,3-6,Decision Point,"Gurgaon/Gurugram, Chennai"
5,Looking For Data Scientist For Infogain,10-20,Infogain India (P) Ltd.,"Noida(Sector-60 Noida), Bangalore/Bengaluru(El..."
6,Business Analyst- Data Scientist,2-5,Wipro,"Noida, Gurgaon/Gurugram"
7,Sr. Data Scientist,6-8,VALIANCE ANALYTICS PRIVATE LIMITED,"Bangalore/Bengaluru, Delhi / NCR"
8,Data Scientist,4-7,Evalueserve.com Pvt. Ltd,Gurgaon/Gurugram
9,Data Scientist - High growth VC backed Influen...,3-5,Ravgins International Pvt. Ltd.,"Bangalore/Bengaluru, Delhi / NCR, Mumbai (All ..."

### Q4: Write a python program to scrape data for first 10 job results for Data scientist Designation in Noida location. You have to scrape company_name, No. of days ago when job was posted, Rating of the company.
This task will be done in following steps:
1. first get the webpage https://www.glassdoor.co.in/index.htm
2. Enter “Data Scientist” in “Job Title,Keyword,Company” field and enter “Noida” in “location” field.
3. Then click the search button. You will land up in the below page:
4. Then scrape the data for the first 10 jobs results you get in the above shown page.
5. Finally create a dataframe of the scraped data.
Note- All of the above steps have to be done in code. No step is to be done manually.

In [67]:
driver = webdriver.Chrome(r"C:\Users\User\Downloads\chromedriver_win32\chromedriver.exe")

In [68]:
url = "https://www.glassdoor.co.in/index.htm?countryRedirect=true"
driver.get(url)

In [ ]:
signin_button = driver.find_element_by_xpath("//button[@class = 'd-none d-lg-block p-0 LockedHomeHeaderStyles__signInButton']")
signin_button.click()

In [ ]:
#manually login using email id and password for glassdoor website

In [69]:
search_job = driver.find_element_by_id('sc.keyword')
search_job

In [70]:
search_job.send_keys("Data Scientist")

In [71]:
search_loc = driver.find_element_by_id('sc.location')
search_loc

In [72]:
#search_loc.clear()

In [73]:
for i in range(0,10):
    search_loc.send_keys(Keys.BACKSPACE)

In [74]:
search_loc.send_keys("Noida")

In [75]:
search_button = driver.find_element_by_xpath("//button[@class ='gd-ui-button ml-std col-auto SearchStyles__newSearchButton css-iixdfr']")
search_button.click()

In [76]:
company_tags= driver.find_elements_by_xpath("//a[@class=' css-l2wjgv e1n63ojh0 jobLink']")
company_titles = []
for i in company_tags:
    company_titles.append(i.text)

In [77]:
rating_tags= driver.find_elements_by_xpath("//span[@class='css-19pjha7 e1cjmv6j1']")
rating_titles = []
for i in rating_tags:
    rating_titles.append(i.text)

In [78]:
days_tags = driver.find_elements_by_xpath("//div[@class='d-flex align-items-end pl-std css-mi55ob']")
days_titles = []
for i in days_tags:
    days_titles.append(i.text)

In [79]:
print(len(company_titles),len(rating_titles),len(days_titles))

32 25 32

In [80]:
#import pandas as pd

In [81]:
df = pd.DataFrame(np.column_stack([company_titles[0:10], rating_titles[0:10], days_titles[0:10]]), 
                               columns=["Company Name", "Rating","Days since job was posted"])

In [82]:
df

               Company Name Rating Days since job was posted
0                   Bechtel    4.0                       26d
1        UnitedHealth Group    3.6                        1d
2                  Ericsson    4.1                       24d
3                              4.3                        4d
4            Biz2Credit Inc    3.8                        4d
5          Mansha Solutions    3.5                       19d
6                  Sparkbpl    3.7                       23d
7  Lantern Digital Services    4.1                       17d
8           Priority Vendor    3.9                       23d
9   Boston Consulting Group    3.1                       10d

### Q5: Write a python program to scrape the salary data for Data Scientist designation in Noida location.
You have to scrape Company name, Number of salaries, Average salary, Min salary, Max Salary.
The above task will be, done as shown in the below steps:
1. first get the webpage https://www.glassdoor.co.in/Salaries/index.htm
2. Enter “Data Scientist” in Job title field and “Noida” in location field.
3. Click the search button.
4. After that you will land on the below page
You have to scrape whole data from this webpage
5. Scrape data for first 10 companies. Scrape the min salary, max salary, company name, Average salary and rating of the company.
6.Store the data in a dataframe.
Note that all of the above steps have to be done by coding only and not manually.

In [83]:
driver = webdriver.Chrome(r"C:\Users\User\Downloads\chromedriver_win32\chromedriver.exe")

In [84]:
url = "https://www.glassdoor.co.in/Salaries/index.htm"
driver.get(url)

In [85]:
search_job = driver.find_element_by_id('KeywordSearch')
search_job

In [86]:
search_job.send_keys("Data Scientist")

In [87]:
search_loc = driver.find_element_by_id('LocationSearch')
search_loc

In [88]:
#search_loc.clear()

In [89]:
for i in range(0,10):
    search_loc.send_keys(Keys.BACKSPACE)

In [90]:
search_loc.send_keys("Noida")

In [91]:
search_button = driver.find_element_by_xpath("//button[@class ='gd-btn-mkt']")
search_button.click()

In [92]:
para = driver.find_elements_by_xpath("//div[@class='d-flex']")
para_list = []
for i in para:
    para_list.append(i.text.replace('Data Scientist\n', ""))

In [93]:
para_list

['Tata Consultancy Services\n17 salaries\nSee 132 salaries from all locations',
 'IBM\n15 salaries\nSee 119 salaries from all locations',
 'Accenture\n14 salaries\nSee 62 salaries from all locations',
 'Ericsson-Worldwide\n14 salaries\nSee 31 salaries from all locations',
 'Delhivery\n14 salaries\nSee 18 salaries from all locations',
 'UnitedHealth Group\n11 salaries\nSee 18 salaries from all locations',
 'Valiance Solutions\n9 salaries\nSee 11 salaries from all locations',
 'ZS Associates\n8 salaries\nSee 21 salaries from all locations',
 'EXL Service\n8 salaries\nSee 10 salaries from all locations',
 'Optum Global Solutions\nOptum Global Solutions\n8 salaries\nSee 12 salaries from all locations',
 'Innovaccer\n8 salaries\nSee 12 salaries from all locations',
 'Cognizant Technology Solutions\n6 salaries\nSee 60 salaries from all locations',
 'Optum\n6 salaries\nSee 19 salaries from all locations',
 'Data Scientist - Monthly\nVidooly Media Tech\n6 salaries\nSee 13 salaries from all locations',
 'Tech Mahindra\n5 salaries\nSee 24 salaries from all locations',
 'OYO\n5 salaries\nSee 11 salaries from all locations',
 'Nagarro\n5 salaries\nSee 5 salaries from all locations',
 'dunnhumby\n5 salaries\nSee 8 salaries from all locations',
 'Algo8.ai\n5 salaries\nSee 8 salaries from all locations',
 'Amazon\n4 salaries\nSee 37 salaries from all locations']

In [94]:
df = pd.DataFrame(np.column_stack([para_list[0:10]]), columns=["Job_Role"])

In [95]:
df["Job_Role"][1]

'IBM\n15 salaries\nSee 119 salaries from all locations'

In [96]:
df[['Company Name', 'Salaries', 'Salaries_All Loc', 'Additional']] = df.Job_Role.str.split("\n",expand=True)

In [97]:
df.drop(columns="Job_Role", axis = 1, inplace = True)

In [98]:
len(df)

10

In [99]:
for i in range(0,len(df)):
    if (df["Company Name"][i]==df["Salaries"][i]):
        print(df["Salaries"][i])
        print(df["Salaries_All Loc"][i])
        df["Salaries"][i] = df["Salaries_All Loc"][i]
        df["Salaries_All Loc"][i] = df["Additional"][i]

Optum Global Solutions
8 salaries

In [100]:
df.drop(columns="Additional", axis = 1, inplace=True)

In [101]:
df

                Company Name     Salaries                     Salaries_All Loc
0  Tata Consultancy Services  17 salaries  See 132 salaries from all locations
1                        IBM  15 salaries  See 119 salaries from all locations
2                  Accenture  14 salaries   See 62 salaries from all locations
3         Ericsson-Worldwide  14 salaries   See 31 salaries from all locations
4                  Delhivery  14 salaries   See 18 salaries from all locations
5         UnitedHealth Group  11 salaries   See 18 salaries from all locations
6         Valiance Solutions   9 salaries   See 11 salaries from all locations
7              ZS Associates   8 salaries   See 21 salaries from all locations
8                EXL Service   8 salaries   See 10 salaries from all locations
9     Optum Global Solutions   8 salaries   See 12 salaries from all locations

In [102]:
avgsal_e= driver.find_elements_by_xpath("//div[@class='col-2 d-none d-md-flex flex-row justify-content-end']")
avgsal = []
for i in avgsal_e:
    avgsal.append(i.text)

In [103]:
avgsal[:10]

['₹ 6,14,306\n/yr',
 '₹ 9,00,000\n/yr',
 '₹ 11,46,533\n/yr',
 '₹ 7,38,057\n/yr',
 '₹ 12,39,781\n/yr',
 '₹ 13,36,142\n/yr',
 '₹ 8,15,192\n/yr',
 '₹ 11,35,221\n/yr',
 '₹ 11,44,243\n/yr',
 '₹ 14,13,288\n/yr']

In [104]:
sal_range_e = driver.find_elements_by_xpath("//div[@class='col-3 offset-1 d-none d-md-block']")
sal_range = []
for i in range(0, len(sal_range_e)):
    sal_range.append(sal_range_e[i].text)
sal_range

['₹343K\n₹1,250K',
 '₹586K\n₹2,730K',
 '₹577K\n₹2,213K',
 '₹355K\n₹1,613K',
 '₹450K\n₹11,622K',
 '₹1,069K\n₹1,520K',
 '₹502K\n₹1,465K',
 '₹202K\n₹1,809K',
 '₹575K\n₹1,520K',
 '₹1,014K\n₹2,149K',
 '₹620K\n₹1,695K',
 '₹792K\n₹1,263K',
 '₹807K\n₹1,986K',
 '₹12K\n₹63K',
 '₹405K\n₹1,703K',
 '₹971K\n₹1,883K',
 '₹400K\n₹1,124K',
 '₹817K\n₹2,006K',
 '₹86K\n₹1,358K',
 '₹772K\n₹2,091K']

In [105]:
df1 = pd.DataFrame(np.column_stack([sal_range[0:10]]), columns=["Sal_Range"])

In [106]:
df1[['Minimum Salary', 'Maximum Salary']] = df1.Sal_Range.str.split("\n",expand=True)

In [107]:
df1.drop(columns="Sal_Range", axis = 1, inplace=True)

In [108]:
df1

  Minimum Salary Maximum Salary
0          ₹343K        ₹1,250K
1          ₹586K        ₹2,730K
2          ₹577K        ₹2,213K
3          ₹355K        ₹1,613K
4          ₹450K       ₹11,622K
5        ₹1,069K        ₹1,520K
6          ₹502K        ₹1,465K
7          ₹202K        ₹1,809K
8          ₹575K        ₹1,520K
9        ₹1,014K        ₹2,149K

In [109]:
df["Min Salary"] = df1["Minimum Salary"]

In [110]:
df["Max Salary"] = df1["Maximum Salary"]

In [111]:
df

,Company Name,Salaries,Salaries_All Loc,Min Salary,Max Salary
0,Tata Consultancy Services,17 salaries,See 132 salaries from all locations,₹343K,"₹1,250K"
1,IBM,15 salaries,See 119 salaries from all locations,₹586K,"₹2,730K"
2,Accenture,14 salaries,See 62 salaries from all locations,₹577K,"₹2,213K"
3,Ericsson-Worldwide,14 salaries,See 31 salaries from all locations,₹355K,"₹1,613K"
4,Delhivery,14 salaries,See 18 salaries from all locations,₹450K,"₹11,622K"
5,UnitedHealth Group,11 salaries,See 18 salaries from all locations,"₹1,069K","₹1,520K"
6,Valiance Solutions,9 salaries,See 11 salaries from all locations,₹502K,"₹1,465K"
7,ZS Associates,8 salaries,See 21 salaries from all locations,₹202K,"₹1,809K"
8,EXL Service,8 salaries,See 10 salaries from all locations,₹575K,"₹1,520K"
9,Optum Global Solutions,8 salaries,See 12 salaries from all locations,"₹1,014K","₹2,149K"

### Q6 : Scrape data of first 100 sunglasses listings on flipkart.com. You have to scrape four attributes:
1. Brand
2. Product Description
3. Price
4. Discount %

The attributes which you have to scrape is ticked marked in the below image.
To scrape the data you have to go through following steps:
1. Go to flipkart webpage by url https://www.flipkart.com/
2. Enter “sunglasses” in the search field where “search for products, brands and more” is written and click the search icon
3. after that you will reach to a webpage having a lot of sunglasses. From this page you can scrap the required data as usual.
4. after scraping data from the first page, go to the “Next” Button at the bottom of the page , then click on it
5. Now scrape data from this page as usual
6. repeat this until you get data for 100 sunglasses.
Note that all of the above steps have to be done by coding only and not manually.

In [112]:
driver = webdriver.Chrome(r"C:\Users\User\Downloads\chromedriver_win32\chromedriver.exe")
url = "https://www.flipkart.com/"
driver.get(url)

In [113]:
#close the pop up for signing into flipkart
close_popup = driver.find_element_by_xpath("//button[@class = '_2KpZ6l _2doB4z']")
close_popup.click()

In [114]:
search = driver.find_element_by_xpath("//div[@class = '_3OO5Xc']/input")

In [115]:
search.send_keys("sunglasses")

In [116]:
driver.find_element_by_xpath("//button[@class = 'L0Z3Pu']").click()

In [117]:
urls  = []
for j in driver.find_elements_by_xpath('//nav[@class="yFHi8N"]/a'):
    urls.append(j.get_attribute('href'))

In [118]:
urls.pop() #the last url point to page 2 again, hence removing it
len(urls)

10

In [119]:
desc = []

for i in urls:
    driver.get(i)
    desc_e = driver.find_elements_by_xpath("//div[@class='_2B099V']")
    for j in desc_e:
        desc.append(j.text)

In [120]:
desc[0]

'AISLIN\nUV Protection, Gradient Butterfly, Wayfarer Sunglasses ...\n₹539₹1,52564% off'

In [121]:
df = pd.DataFrame(np.column_stack([desc[0:100]]), columns=["Company Name"])

In [122]:
df[['Company Name', 'Description', 'Price', 'Discount%', '2', '3']] = df["Company Name"].str.split("\n",expand=True)

In [123]:
df.drop(columns = ["2", "3"], axis=1, inplace= True)

In [124]:
df.head()

,Company Name,Description,Price,Discount%
0,AISLIN,"UV Protection, Gradient Butterfly, Wayfarer Su...","₹539₹1,52564% off",None
1,hipe,"Mirrored, UV Protection, Gradient Round Sungla...","₹210₹1,46685% off",None
2,Fastrack,UV Protection Rectangular Sunglasses (Free Size),₹570₹79928% off,Or Pay ₹541 +
3,ROZZETTA CRAFT,UV Protection Retro Square Sunglasses (Free Size),"₹499₹2,22577% off",None
4,ROZZETTA CRAFT,UV Protection Retro Square Sunglasses (Free Size),"₹499₹2,25277% off",None

In [125]:
for i in range(0, len(df)):
    df["Discount%"][i] = df["Price"][i][-7:-4]
    df["Price"][i] = df["Price"][i][0:4]

In [126]:
df

,Company Name,Description,Price,Discount%
0,AISLIN,"UV Protection, Gradient Butterfly, Wayfarer Su...",₹539,64%
1,hipe,"Mirrored, UV Protection, Gradient Round Sungla...",₹210,85%
2,Fastrack,UV Protection Rectangular Sunglasses (Free Size),₹570,28%
3,ROZZETTA CRAFT,UV Protection Retro Square Sunglasses (Free Size),₹499,77%
4,ROZZETTA CRAFT,UV Protection Retro Square Sunglasses (Free Size),₹499,77%
...,...,...,...,...
95,hipe,"Mirrored, UV Protection, Gradient Round Sungla...",₹210,85%
96,ROYAL SON,UV Protection Retro Square Sunglasses (58),₹499,66%
97,Singco India,"Mirrored, UV Protection, Riding Glasses, Other...",₹349,82%
98,Fastrack,UV Protection Aviator Sunglasses (58),"₹1,1",11%
99,Silver Kartz,UV Protection Aviator Sunglasses (88),₹255,78%

### Q7: Scrape 100 reviews data from flipkart.com for iphone11 phone. You have to go the link: 
https://www.flipkart.com/apple-iphone-11-black-64-gb-includes-earpods-power-adapter/p/itm0f37c2240b217?pid=MOBFKCTSVZAXUHGR&lid=LSTMOBFKCTSVZAXUHGREPBFGI&marketplace.
When you will open the above link you will reach to the below shown webpage.
As shown in the above page you have to scrape the tick marked attributes.
These are
1. Rating
2. Review_summary
3. Full review
You have to scrape this data for first 100 reviews.

In [127]:
driver = webdriver.Chrome(r"C:\Users\User\Downloads\chromedriver_win32\chromedriver.exe")
url = "https://www.flipkart.com/apple-iphone-11-black-64-gb-includes-earpods-power-adapter/p/itm0f37c2240b217?pid=MOBFKCTSVZAXUHGR&lid=LSTMOBFKCTSVZAXUHGREPBFGI&marketplace"
driver.get(url)

In [128]:
driver.find_element_by_xpath("//div[@class = '_3UAT2v _16PBlm']").click()

In [129]:
urls  = []
for j in driver.find_elements_by_xpath('//nav[@class="yFHi8N"]/a'):
    urls.append(j.get_attribute('href'))

In [130]:
len(urls)

11

In [131]:
urls.pop() #the last url point to page 2 again, hence removing it
len(urls)

10

In [132]:
rating = []
review_summary = []
full_review = []

for i in urls:
    driver.get(i)
    rating_e = driver.find_elements_by_xpath("//div[@class='_1AtVbE col-12-12']")
    for j in rating_e:
        k = j.text
        if k[0] in ['1','2','3','4','5']:
            rating.append(k[0])
    del rating[0]
    review_summary_e = driver.find_elements_by_xpath("//p[@class='_2-N8zT']")
    for j in review_summary_e:
        review_summary.append(j.text)
    full_review_e = driver.find_elements_by_xpath("//div[@class='t-ZTKy']")
    for j in full_review_e:
        full_review.append(j.text)

In [133]:
len(rating)

100

In [134]:
df = pd.DataFrame(np.column_stack([rating, review_summary, full_review]), 
                               columns=["Rating", "Review Summary","Full Review"])

In [135]:
df.head()

  Rating     Review Summary                                        Full Review
0      5          Brilliant  The Best Phone for the Money\n\nThe iPhone 11 ...
1      4   Perfect product!  Amazing phone with great cameras and better ba...
2      5      Great product  Amazing Powerful and Durable Gadget.\n\nI’m am...
3      5  Worth every penny  Previously I was using one plus 3t it was a gr...
4      5        Good choice  So far it’s been an AMAZING experience coming ...

### Q8: Scrape data for first 100 sneakers you find when you visit flipkart.com and search for “sneakers” in the search field.
You have to scrape 4 attributes of each sneaker :
1. Brand
2. Product Description
3. Price
4. discount %
As shown in the below image, you have to scrape the tick marked attributes.
Also note that all the steps required during scraping should be done through code only and not manually.

In [143]:
driver = webdriver.Chrome(r"C:\Users\User\Downloads\chromedriver_win32\chromedriver.exe")
url = "https://www.flipkart.com/"
driver.get(url)

In [144]:
#close the pop up for signing into flipkart
close_popup = driver.find_element_by_xpath("//button[@class = '_2KpZ6l _2doB4z']")
close_popup.click()

In [145]:
search = driver.find_element_by_xpath("//div[@class = '_3OO5Xc']/input")

In [146]:
search.send_keys("sneakers")

In [147]:
driver.find_element_by_xpath("//button[@class = 'L0Z3Pu']").click()

In [148]:
urls  = []
for j in driver.find_elements_by_xpath('//nav[@class="yFHi8N"]/a'):
    urls.append(j.get_attribute('href'))

In [149]:
urls.pop() #the last url point to page 2 again, hence removing it
len(urls)

10

In [150]:
desc = []

for i in urls:
    driver.get(i)
    desc_e = driver.find_elements_by_xpath("//div[@class='_2B099V']")
    for j in desc_e:
        desc.append(j.text)

In [151]:
desc[0]

'Robbie jones\nCasual Sneakers Black Shoes For Men Sneakers For Men\n₹451₹99954% off\nOr Pay ₹428 + \n 23'

In [152]:
df = pd.DataFrame(np.column_stack([desc[0:100]]), columns=["Company Name"])

In [153]:
df[['Company Name', 'Description', 'Price', 'Discount%', '2', '3']] = df["Company Name"].str.split("\n",expand=True)

In [154]:
df.drop(columns = ["2", "3"], axis=1, inplace= True)

In [155]:
df.head()

,Company Name,Description,Price,Discount%
0,Robbie jones,Casual Sneakers Black Shoes For Men Sneakers F...,₹451₹99954% off,Or Pay ₹428 +
1,BRUTON,Combo Pack Of 4 Canvas Sneakers For Men,"₹449₹3,49987% off",None
2,Magnolia,Sneakers For Men,₹356₹99964% off,"Buy ₹10 more, save extra 10%"
3,Robbie jones,Casual Sneakers Shoes For Men Sneakers For Men,₹399₹99960% off,None
4,ORICUM,Combo pack of 2 casual sneaker shoes for men S...,₹377₹99862% off,Or Pay ₹358 +

In [156]:
for i in range(0, len(df)):
    df["Discount%"][i] = df["Price"][i][-7:-4]
    df["Price"][i] = df["Price"][i][0:4]

In [157]:
df

,Company Name,Description,Price,Discount%
0,Robbie jones,Casual Sneakers Black Shoes For Men Sneakers F...,₹451,54%
1,BRUTON,Combo Pack Of 4 Canvas Sneakers For Men,₹449,87%
2,Magnolia,Sneakers For Men,₹356,64%
3,Robbie jones,Casual Sneakers Shoes For Men Sneakers For Men,₹399,60%
4,ORICUM,Combo pack of 2 casual sneaker shoes for men S...,₹377,62%
...,...,...,...,...
95,M K FOOTWEAR,M K Footwear 702_Blue Sneakers For Men,₹369,63%
96,World Wear Footwear,Latest Collection-1227 Stylish Casual Sports S...,₹273,45%
97,HOCKWOOD,Street Smart Sneakers For Men,₹699,30%
98,PUMA,Rigel IDP Sneakers For Men,"₹1,3",53%
99,Raftar,Sneakers For Men,₹365,63%

### Q9: Go to the link - https://www.myntra.com/shoes
Set Price filter to “Rs. 6649 to Rs. 13099” , Color filter to “Black”, as shown in the below image
And then scrape First 100 shoes data you get. The data should include “Brand” of the shoes , Short Shoe description, price of the shoe as shown in the below image.
Please note Please note that applying the filter and scraping the data , everything should be done through code only and there should not be any manual step.

In [163]:
driver = webdriver.Chrome(r"C:\Users\User\Downloads\chromedriver_win32\chromedriver.exe")
url = "https://www.myntra.com/shoes"
driver.get(url)

In [164]:
filter_button = driver.find_elements_by_xpath("//label[@class = 'common-customCheckbox']")
for i in filter_button:
    if 'Black' in i.text :
        i.click() 
        break

In [166]:
filter_button = driver.find_elements_by_xpath("//label[@class = 'common-customCheckbox vertical-filters-label']")
for i in filter_button:
    if 'Rs. 6657 to Rs. 13105' in i.text :
        i.click() 
        break

In [170]:
desc = []
for i in range(0,2):
    desc_e = driver.find_elements_by_xpath("//div[@class='product-productMetaInfo']")
    time.sleep(3)
    for j in desc_e:
        desc.append(j.text)
    driver.find_element_by_xpath('//li[@class="pagination-next"]').click()

In [171]:
len(desc)

100

In [172]:
desc[0]

'PUMA Motorsport\nUnisex Mercedes Running Shoes\nRs. 7999\nOnly Few Left!'

In [173]:
desc_e = driver.find_elements_by_xpath("//div[@class='product-productMetaInfo']")
for j in desc_e:
    desc.append(j.text)

In [174]:
desc[0]

'PUMA Motorsport\nUnisex Mercedes Running Shoes\nRs. 7999\nOnly Few Left!'

In [175]:
df = pd.DataFrame(desc, columns =['Company Name'])

In [176]:
df.head()

                                        Company Name
0  PUMA Motorsport\nUnisex Mercedes Running Shoes...
1       ALDO\nMen Sneakers\nRs. 9999\nOnly Few Left!
2  Nike\nMen JOYRIDE Running Shoes\nRs. 10496Rs. ...
3  FORCLAZ By Decathlon\nTREKKING 100 Boots\nRs. ...
4  Nike\nAIR ZOOM PEGASUS Running Shoes\nRs. 1092...

In [177]:
df[['Company Name', 'Description', 'Price', 'Extra']] = df["Company Name"].str.split("\n",expand=True)

In [178]:
df.head()

,Company Name,Description,Price,Extra
0,PUMA Motorsport,Unisex Mercedes Running Shoes,Rs. 7999,Only Few Left!
1,ALDO,Men Sneakers,Rs. 9999,Only Few Left!
2,Nike,Men JOYRIDE Running Shoes,Rs. 10496Rs. 14995(30% OFF),None
3,FORCLAZ By Decathlon,TREKKING 100 Boots,Rs. 6999,None
4,Nike,AIR ZOOM PEGASUS Running Shoes,Rs. 10920Rs. 11495(5% OFF),None

In [179]:
df.drop(columns = ["Extra"], axis=1, inplace= True)

In [180]:
df[['Extra', 'Price','Price before discount']] = df["Price"].str.split("Rs. ",expand=True)

In [181]:
df.head()

,Company Name,Description,Price,Extra,Price before discount
0,PUMA Motorsport,Unisex Mercedes Running Shoes,7999,,None
1,ALDO,Men Sneakers,9999,,None
2,Nike,Men JOYRIDE Running Shoes,10496,,14995(30% OFF)
3,FORCLAZ By Decathlon,TREKKING 100 Boots,6999,,None
4,Nike,AIR ZOOM PEGASUS Running Shoes,10920,,11495(5% OFF)

In [182]:
df.drop(columns = ['Extra', 'Price before discount'], axis = 1, inplace = True)

In [183]:
df.head()

           Company Name                     Description  Price
0       PUMA Motorsport   Unisex Mercedes Running Shoes   7999
1                  ALDO                    Men Sneakers   9999
2                  Nike       Men JOYRIDE Running Shoes  10496
3  FORCLAZ By Decathlon              TREKKING 100 Boots   6999
4                  Nike  AIR ZOOM PEGASUS Running Shoes  10920

### Q10: Go to webpage https://www.amazon.in/
Enter “Laptop” in the search field and then click the search icon.
Then set CPU Type filter to “Intel Core i7” and “Intel Core i9” as shown in the below image:

After setting the filters scrape first 10 laptops data. You have to scrape 3 attributes for each laptop:
1. title
2. Ratings
3. Price
As shown in the below image as the tick marked attributes.

In [184]:
driver = webdriver.Chrome(r"C:\Users\User\Downloads\chromedriver_win32\chromedriver.exe")

In [185]:
url = "https://www.amazon.in/"
driver.get(url)

In [186]:
search = driver.find_element_by_id("twotabsearchtextbox")

In [187]:
search.send_keys("Laptop")

In [188]:
driver.find_element_by_id("nav-search-submit-button").click()

In [189]:
#i7 filter
filter_button = driver.find_elements_by_xpath("//a[@class = 'a-link-normal s-navigation-item']/span")
for i in filter_button:
    if i.text == 'Intel Core i7':
        i.click()
        break

In [190]:
#i9 filter 
#Note: only 1 filter is acceptable at a time, either i7 or i9
filter_button = driver.find_elements_by_xpath("//a[@class = 'a-link-normal s-navigation-item']/span")
for i in filter_button:
    if i.text == 'Intel Core i9':
        i.click()
        break

In [191]:
title = []
rating = []
price = []

title_e = driver.find_elements_by_xpath("//span[@class='a-size-medium a-color-base a-text-normal']")
for j in title_e:
    title.append(j.text)

rating_e = driver.find_elements_by_xpath('//div[@class="a-section a-spacing-none a-spacing-top-micro"]/div/span')
for j in rating_e:
    if (j.get_attribute('aria-label') != None) and ('stars' in j.get_attribute('aria-label')):
        rating.append(j.get_attribute('aria-label'))
    
price_e = driver.find_elements_by_xpath("//span[@class='a-price-whole']")
for j in price_e:
        price.append(j.text)

In [192]:
df = pd.DataFrame(np.column_stack([title[0:10], rating[0:10], price[0:10]]), 
                               columns=["Title", "Rating","Price"])

In [193]:
df.head()

,Title,Rating,Price
0,ASUS ZenBook Duo Intel Core i7-10510U 10th Gen...,4.6 out of 5 stars,"1,32,890"
1,ASUS VivoBook S S14 Intel Core i7-1165G7 11th ...,4.4 out of 5 stars,"77,990"
2,HP Pavilion (2021) Thin & Light 11th Gen Core ...,4.4 out of 5 stars,"84,490"
3,HP Pavilion Gaming 10th Gen Intel Core i7 Proc...,3.6 out of 5 stars,"53,999"
4,Mi Notebook Horizon Edition 14 Intel Core i5-1...,4.4 out of 5 stars,"89,990"